share/tutorials/incompressible/non-newtonian-ico/offset_cylinder/0/U
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volVectorField;
  object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
  left
  {
    type            fixedValue;
    value           uniform (1 0 0);
  }
  right
  {
    type            zeroGradient;
  }
  down
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  up
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  cylinder
  {
    type            fixedValue;
    value           uniform (0 0 0);
  }
  defaultFaces
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
