share/tutorials/incompressible/non-newtonian-ico/offset_cylinder/0/p
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       volScalarField;
  object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
  left
  {
    type            zeroGradient;
  }
  right
  {
    type            fixedValue;
    value           uniform 0;
  }
  down
  {
    type            zeroGradient;
  }
  up
  {
    type            zeroGradient;
  }
  cylinder
  {
    type            zeroGradient;
  }
  defaultFaces
  {
    type            empty;
  }
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
