share/tutorials/incompressible/non-newtonian-ico/offset_cylinder/system/fvSolution
// mousse: CFD toolbox

FoamFile
{
  version     2.0;
  format      ascii;
  class       dictionary;
  location    "system";
  object      fvSolution;
}

solvers
{
  p
  {
    solver          GAMG;
    tolerance       0;
    relTol          0.1;
    smoother        GaussSeidel;
    nPreSweeps      0;
    nPostSweeps     2;
    cacheAgglomeration true;
    nCellsInCoarsestLevel 10;
    agglomerator    faceAreaPair;
    mergeLevels     1;
  }
  U
  {
    solver          smoothSolver;
    smoother        symGaussSeidel;
    tolerance       1e-05;
    relTol          0;
  }
}
PISO
{
  nCorrectors     4;
  nNonOrthogonalCorrectors 2;
}

// vim: set ft=foam et sw=2 ts=2 sts=2:
